import React from 'react';
import './Testimonials.css'; // Import the CSS for styling

function Testimonials() {
  return (
    <section className="testimonials-section">
      <h2 className="testimonials-title">הורים מספרים</h2>

      <div className="testimonials-grid">
        <div className="testimonial">
          <p><strong>.דוד ב</strong></p>
          <p> סמדר יקרה, תודה ענקית על התמיכה באביתר. העזרה והפתרונות היצירתיים שלך לקשיים שהיו לו פשוט מעוררי הערצה. רואים שאת עובדת מהלב, פתחת לי ערוץ אחר לקשר שלי איתו</p>
        </div>

        <div className="testimonial">
          <p><strong>.מאשה ט</strong></p>
          <p>אין לי מילים לתאר את מה שאני מרגישה! מילדה שהייתה בחרם החל מכיתה א', נתת לי כלים להתמודד מול ההורים של הילדים בכיתה, כיצד להתנהל עם הבת שלי ובזכותך היא קיבלה ממני עצות להעצמה. הביטחון העצמי שלה גדל, היא שמחה להגיע לבית הספר, יש לה חברות. היחסים בבית השתנו פלאים ומילדה מגוננת מדי, היא בעלת תחושת מסוגלות</p>
        </div>

        <div className="testimonial">
          <p><strong>.מיכל כ</strong></p>
          <p>סמדר אהובה, תודה על כל העזרה ברגעים הקשים, על התמיכה והייעוץ המתמיד, שאין לי ספק שיהיו משמעותיים גם בעתיד. תודה על ההקשבה, הנתינה וטוב ליבך. ברגישותך ובחוכמתך לקחת נער בגיל ההתבגרות, עם כל המורכבויות שיש בו, והפכת אותו מ״סלע בזלת״ ליהלום. הקשר בינינו לאסף השתנה לטובה, תודות לך</p>
        </div>

        <div className="testimonial">
          <p><strong>.שרית ד</strong></p>
          <p>תודה על הייעוץ וההכוונה שהיו משמעותיים במיוחד בתקופת הקורונה, בה אמיר היה מבודד מהחברים בכיתה, והם התראו רק בזום. הצלחנו לשמור בבית על אווירה תומכת וגבולות, בתוך כל הכאוס שהיה, כך שהוא הצליח לחזור למסגרת בצורה הכי טובה שיכולה הייתה להיות</p>
        </div>
      </div>
    </section>
  );
}

export default Testimonials;